## 📝 Terraform Plan Result (dev)

```terraform
Acquiring state lock. This may take a few moments...
module.eip_was.aws_eip.main: Refreshing state... [id=eipalloc-0dcd414bd0f84fe86]
module.eip_jenkins.aws_eip.main: Refreshing state... [id=eipalloc-0416fa4edb25f5c6f]
data.aws_ami.ubuntu_latest: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-057adc9a1eada1de9]
module.rds_mysql.aws_db_parameter_group.main: Refreshing state... [id=cherrypic-db-parameter-group]
data.aws_ami.ubuntu_latest: Read complete after 1s [id=ami-01f71f215b23ba262]
module.public_subnet_2.aws_subnet.main: Refreshing state... [id=subnet-01db3e4fc3993cb65]
module.public_subnet_1.aws_subnet.main: Refreshing state... [id=subnet-057da2c4681ade9a7]
module.internet_gateway.aws_internet_gateway.main: Refreshing state... [id=igw-07a84e87099bfca5f]
module.private_subnet_1.aws_subnet.main: Refreshing state... [id=subnet-0954ef8a15a2713c1]
module.jenkins_dev_sg.aws_security_group.main: Refreshing state... [id=sg-0d8900e194b0a4a49]
module.private_subnet_2.aws_subnet.main: Refreshing state... [id=subnet-0f52437b2467db9e5]
module.public_route_table.aws_route_table.main: Refreshing state... [id=rtb-0b227b5ee413e49a1]
module.cache_dev_sg.aws_security_group.main: Refreshing state... [id=sg-07b667f240dcf3872]
module.was_dev_sg.aws_security_group.main: Refreshing state... [id=sg-08d12b3a96ab9c2f1]
module.private_route_table.aws_route_table.main: Refreshing state... [id=rtb-035dc66d49319e396]
module.bastion_dev_sg.aws_security_group.main: Refreshing state... [id=sg-07de8c1a202bd8632]
module.db_dev_sg.aws_security_group.main: Refreshing state... [id=sg-0152683282f8bb08c]
module.public_subnet_2.aws_route_table_association.main: Refreshing state... [id=rtbassoc-083b8b88bc09a339c]
module.jenkins_dev.aws_instance.main: Refreshing state... [id=i-0c39c8e0d39feee3f]
module.public_route_table.aws_route.igw[0]: Refreshing state... [id=r-rtb-0b227b5ee413e49a11080289494]
module.public_subnet_1.aws_route_table_association.main: Refreshing state... [id=rtbassoc-01cdad2d0a5bda93f]
module.rds_mysql.aws_db_subnet_group.main: Refreshing state... [id=cherrypic-db-subnet-group]
module.cache_dev.aws_elasticache_subnet_group.main: Refreshing state... [id=cherrypic-cache-subnet-group]
module.was_dev.aws_instance.main: Refreshing state... [id=i-0bcf161d291cb449d]
module.private_subnet_2.aws_route_table_association.main: Refreshing state... [id=rtbassoc-04e784358d4a7f289]
module.private_subnet_1.aws_route_table_association.main: Refreshing state... [id=rtbassoc-03032bb2f172435ef]
module.bastion_dev.aws_instance.main: Refreshing state... [id=i-03ec6ec9b2ed696e3]
module.jenkins_dev.aws_eip_association.main[0]: Refreshing state... [id=eipassoc-0a68a06ac3326ab2f]
module.was_dev.aws_eip_association.main[0]: Refreshing state... [id=eipassoc-02689738aab8b8240]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bastion_dev.aws_instance.main will be updated in-place
  ~ resource "aws_instance" "main" {
        id                                   = "i-03ec6ec9b2ed696e3"
      ~ tags                                 = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          ~ "Name"        = "cherrypic-bastion-host" -> "cherrypic-bastion-dev"
          + "Team"        = "backend"
        }
      ~ tags_all                             = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          ~ "Name"        = "cherrypic-bastion-host" -> "cherrypic-bastion-dev"
          + "Team"        = "backend"
        }
      + user_data_replace_on_change          = false
      ~ vpc_security_group_ids               = [
          - "sg-07de8c1a202bd8632",
        ] -> (known after apply)
        # (36 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.bastion_dev_sg.aws_security_group.main must be replaced
-/+ resource "aws_security_group" "main" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:805472282514:security-group/sg-07de8c1a202bd8632" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ id                     = "sg-07de8c1a202bd8632" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ name                   = "bastion-host-sg" -> "bastion-host-dev-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "805472282514" -> (known after apply)
      + revoke_rules_on_delete = false
      ~ tags                   = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          ~ "Name"        = "bastion-host-sg" -> "bastion-host-dev-sg"
          + "Team"        = "backend"
        }
      ~ tags_all               = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          ~ "Name"        = "bastion-host-sg" -> "bastion-host-dev-sg"
          + "Team"        = "backend"
        }
        # (2 unchanged attributes hidden)
    }

  # module.bastion_dev_sg.aws_security_group_rule.egress["0"] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.bastion_dev_sg.aws_security_group_rule.ingress_cidr["0"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.cache_dev.aws_elasticache_cluster.main will be created
  + resource "aws_elasticache_cluster" "main" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "cherrypic-cache-dev"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "8.0"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t2.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.valkey8"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = [
          + "sg-07b667f240dcf3872",
        ]
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "cherrypic-cache-subnet-group"
      + tags                       = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cherrypic-cache-dev"
          + "Team"        = "backend"
        }
      + tags_all                   = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cherrypic-cache-dev"
          + "Team"        = "backend"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # module.cache_dev.aws_elasticache_subnet_group.main will be updated in-place
  ~ resource "aws_elasticache_subnet_group" "main" {
      ~ description = " " -> "Cherrypic cache subnet group"
        id          = "cherrypic-cache-subnet-group"
        name        = "cherrypic-cache-subnet-group"
        tags        = {}
        # (3 unchanged attributes hidden)
    }

  # module.cache_dev_sg.aws_security_group.main will be updated in-place
  ~ resource "aws_security_group" "main" {
        id                     = "sg-07b667f240dcf3872"
        name                   = "cache-dev-sg"
      + revoke_rules_on_delete = false
      ~ tags                   = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cache-dev-sg"
          + "Team"        = "backend"
        }
      ~ tags_all               = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cache-dev-sg"
          + "Team"        = "backend"
        }
        # (7 unchanged attributes hidden)
    }

  # module.cache_dev_sg.aws_security_group_rule.egress["0"] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-07b667f240dcf3872"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.cache_dev_sg.aws_security_group_rule.ingress_sg["0"] will be created
  + resource "aws_security_group_rule" "ingress_sg" {
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-07b667f240dcf3872"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # module.cache_dev_sg.aws_security_group_rule.ingress_sg["1"] will be created
  + resource "aws_security_group_rule" "ingress_sg" {
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-07b667f240dcf3872"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-08d12b3a96ab9c2f1"
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # module.db_dev_sg.aws_security_group.main will be updated in-place
  ~ resource "aws_security_group" "main" {
        id                     = "sg-0152683282f8bb08c"
        name                   = "db-dev-sg"
      + revoke_rules_on_delete = false
      ~ tags                   = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "db-dev-sg"
          + "Team"        = "backend"
        }
      ~ tags_all               = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.db_dev_sg.aws_security_group_rule.egress["0"] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-0152683282f8bb08c"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.db_dev_sg.aws_security_group_rule.ingress_sg["0"] will be created
  + resource "aws_security_group_rule" "ingress_sg" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0152683282f8bb08c"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-08d12b3a96ab9c2f1"
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.db_dev_sg.aws_security_group_rule.ingress_sg["1"] will be created
  + resource "aws_security_group_rule" "ingress_sg" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0152683282f8bb08c"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.eip_jenkins.aws_eip.main will be updated in-place
  ~ resource "aws_eip" "main" {
        id                       = "eipalloc-0416fa4edb25f5c6f"
      ~ tags                     = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
        }
      ~ tags_all                 = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
        }
        # (15 unchanged attributes hidden)
    }

  # module.eip_was.aws_eip.main will be updated in-place
  ~ resource "aws_eip" "main" {
        id                       = "eipalloc-0dcd414bd0f84fe86"
      ~ tags                     = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
        }
      ~ tags_all                 = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
        }
        # (15 unchanged attributes hidden)
    }

  # module.internet_gateway.aws_internet_gateway.main will be updated in-place
  ~ resource "aws_internet_gateway" "main" {
        id       = "igw-07a84e87099bfca5f"
      ~ tags     = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-igw"
          + "Team"        = "backend"
        }
      ~ tags_all = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.jenkins_dev.aws_eip_association.main[0] must be replaced
-/+ resource "aws_eip_association" "main" {
      ~ id                   = "eipassoc-0a68a06ac3326ab2f" -> (known after apply)
      ~ instance_id          = "i-0c39c8e0d39feee3f" -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-01507ca7b124b761b" -> (known after apply)
      ~ private_ip_address   = "10.0.2.242" -> (known after apply)
      ~ public_ip            = "13.209.119.120" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.jenkins_dev.aws_instance.main must be replaced
-/+ resource "aws_instance" "main" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:805472282514:instance/i-0c39c8e0d39feee3f" -> (known after apply)
      ~ associate_public_ip_address          = true -> false # forces replacement
      ~ availability_zone                    = "ap-northeast-2c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = true -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0c39c8e0d39feee3f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-01507ca7b124b761b" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-242.ap-northeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.242" -> (known after apply)
      ~ public_dns                           = "ec2-13-209-119-120.ap-northeast-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.209.119.120" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ tags                                 = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-jenkins-dev"
          + "Team"        = "backend"
        }
      ~ tags_all                             = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      ~ vpc_security_group_ids               = [
          - "sg-0d8900e194b0a4a49",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-062b6245b875d6c5a" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.jenkins_dev_sg.aws_security_group.main must be replaced
-/+ resource "aws_security_group" "main" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:805472282514:security-group/sg-0d8900e194b0a4a49" -> (known after apply)
      ~ description            = "Jenkins Develop Security Group" -> "Jenkins Dev Security Group" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ id                     = "sg-0d8900e194b0a4a49" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        name                   = "jenkins-dev-sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "805472282514" -> (known after apply)
      + revoke_rules_on_delete = false
      ~ tags                   = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "jenkins-dev-sg"
          + "Team"        = "backend"
        }
      ~ tags_all               = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.jenkins_dev_sg.aws_security_group_rule.egress["0"] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.jenkins_dev_sg.aws_security_group_rule.ingress_cidr["0"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.jenkins_dev_sg.aws_security_group_rule.ingress_cidr["1"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.private_route_table.aws_route_table.main will be updated in-place
  ~ resource "aws_route_table" "main" {
        id               = "rtb-035dc66d49319e396"
      ~ tags             = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-private-rt"
          + "Team"        = "backend"
        }
      ~ tags_all         = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.private_subnet_1.aws_subnet.main will be updated in-place
  ~ resource "aws_subnet" "main" {
        id                                             = "subnet-0954ef8a15a2713c1"
      ~ tags                                           = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-private-subnet-1"
          + "Team"        = "backend"
        }
      ~ tags_all                                       = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.private_subnet_2.aws_subnet.main will be updated in-place
  ~ resource "aws_subnet" "main" {
        id                                             = "subnet-0f52437b2467db9e5"
      ~ tags                                           = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-private-subnet-2"
          + "Team"        = "backend"
        }
      ~ tags_all                                       = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.public_route_table.aws_route_table.main will be updated in-place
  ~ resource "aws_route_table" "main" {
        id               = "rtb-0b227b5ee413e49a1"
      ~ tags             = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-public-rt"
          + "Team"        = "backend"
        }
      ~ tags_all         = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.public_subnet_1.aws_subnet.main will be updated in-place
  ~ resource "aws_subnet" "main" {
        id                                             = "subnet-057da2c4681ade9a7"
      ~ tags                                           = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-public-subnet-1"
          + "Team"        = "backend"
        }
      ~ tags_all                                       = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.public_subnet_2.aws_subnet.main will be updated in-place
  ~ resource "aws_subnet" "main" {
        id                                             = "subnet-01db3e4fc3993cb65"
      ~ tags                                           = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-public-subnet-2"
          + "Team"        = "backend"
        }
      ~ tags_all                                       = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.rds_mysql.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "cherrypic-mysql-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.4.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "cherrypic-mysql-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "cherrypic-mysql-parameter-group"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cherrypic-dev-mysql"
          + "Team"        = "backend"
        }
      + tags_all                              = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cherrypic-dev-mysql"
          + "Team"        = "backend"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = [
          + "sg-0152683282f8bb08c",
        ]
    }

  # module.rds_mysql.aws_db_parameter_group.main must be replaced
-/+ resource "aws_db_parameter_group" "main" {
      ~ arn         = "arn:aws:rds:ap-northeast-2:805472282514:pg:cherrypic-db-parameter-group" -> (known after apply)
      ~ description = "DB Parameter Group" -> "Managed by Terraform" # forces replacement
      ~ id          = "cherrypic-db-parameter-group" -> (known after apply)
      ~ name        = "cherrypic-db-parameter-group" -> "cherrypic-mysql-parameter-group" # forces replacement
      + name_prefix = (known after apply)
      ~ tags        = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
        }
      ~ tags_all    = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
        }
        # (1 unchanged attribute hidden)

      - parameter {
          - apply_method = "immediate" -> null
          - name         = "character_set_client" -> null
          - value        = "utf8mb4" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "character_set_connection" -> null
          - value        = "utf8mb4" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "character_set_database" -> null
          - value        = "utf8mb4" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "character_set_filesystem" -> null
          - value        = "utf8mb4" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "character_set_results" -> null
          - value        = "utf8mb4" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "character_set_server" -> null
          - value        = "utf8mb4" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "collation_connection" -> null
          - value        = "utf8mb4_general_ci" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "collation_server" -> null
          - value        = "utf8mb4_general_ci" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "time_zone" -> null
          - value        = "Asia/Seoul" -> null
        }
    }

  # module.rds_mysql.aws_db_subnet_group.main must be replaced
-/+ resource "aws_db_subnet_group" "main" {
      ~ arn                     = "arn:aws:rds:ap-northeast-2:805472282514:subgrp:cherrypic-db-subnet-group" -> (known after apply)
      ~ id                      = "cherrypic-db-subnet-group" -> (known after apply)
      ~ name                    = "cherrypic-db-subnet-group" -> "cherrypic-mysql-subnet-group" # forces replacement
      + name_prefix             = (known after apply)
      ~ supported_network_types = [
          - "IPV4",
        ] -> (known after apply)
      ~ tags                    = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
        }
      ~ tags_all                = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
        }
      ~ vpc_id                  = "vpc-057adc9a1eada1de9" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.was_dev.aws_eip_association.main[0] must be replaced
-/+ resource "aws_eip_association" "main" {
      ~ id                   = "eipassoc-02689738aab8b8240" -> (known after apply)
      ~ instance_id          = "i-0bcf161d291cb449d" -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-05903426cf6c61c1a" -> (known after apply)
      ~ private_ip_address   = "10.0.1.192" -> (known after apply)
      ~ public_ip            = "54.180.66.98" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.was_dev.aws_instance.main must be replaced
-/+ resource "aws_instance" "main" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:805472282514:instance/i-0bcf161d291cb449d" -> (known after apply)
      ~ associate_public_ip_address          = true -> false # forces replacement
      ~ availability_zone                    = "ap-northeast-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0bcf161d291cb449d" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-05903426cf6c61c1a" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-192.ap-northeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.192" -> (known after apply)
      ~ public_dns                           = "ec2-54-180-66-98.ap-northeast-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.180.66.98" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ tags                                 = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-was-dev"
          + "Team"        = "backend"
        }
      ~ tags_all                             = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0a243d5bc2f7d4f7b" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.was_dev_sg.aws_security_group.main will be updated in-place
  ~ resource "aws_security_group" "main" {
        id                     = "sg-08d12b3a96ab9c2f1"
        name                   = "was-dev-sg"
      + revoke_rules_on_delete = false
      ~ tags                   = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
            "Name"        = "was-dev-sg"
          + "Team"        = "backend"
        }
      ~ tags_all               = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Team"        = "backend"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.was_dev_sg.aws_security_group_rule.egress["0"] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-08d12b3a96ab9c2f1"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.was_dev_sg.aws_security_group_rule.ingress_cidr["0"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-08d12b3a96ab9c2f1"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.was_dev_sg.aws_security_group_rule.ingress_cidr["1"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-08d12b3a96ab9c2f1"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.was_dev_sg.aws_security_group_rule.ingress_cidr["2"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-08d12b3a96ab9c2f1"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.was_dev_sg.aws_security_group_rule.ingress_cidr["3"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-08d12b3a96ab9c2f1"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 26 to add, 14 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```